----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
         AvgPool2d-1          [-1, 3, 544, 728]               0
         MaxPool2d-2          [-1, 3, 272, 364]               0
            Conv2d-3         [-1, 32, 136, 182]             864
       BatchNorm2d-4         [-1, 32, 136, 182]              64
         LeakyReLU-5         [-1, 32, 136, 182]               0
  _ConvBNLeakyReLU-6         [-1, 32, 136, 182]               0
            Conv2d-7         [-1, 32, 136, 182]           9,216
       BatchNorm2d-8         [-1, 32, 136, 182]              64
         LeakyReLU-9         [-1, 32, 136, 182]               0
 _ConvBNLeakyReLU-10         [-1, 32, 136, 182]               0
           Conv2d-11         [-1, 32, 136, 182]           9,216
      BatchNorm2d-12         [-1, 32, 136, 182]              64
        LeakyReLU-13         [-1, 32, 136, 182]               0
 _ConvBNLeakyReLU-14         [-1, 32, 136, 182]               0
        AvgPool2d-15          [-1, 3, 136, 182]               0
  _InputInjection-16          [-1, 3, 136, 182]               0
        AvgPool2d-17          [-1, 3, 136, 182]               0
        AvgPool2d-18            [-1, 3, 68, 91]               0
  _InputInjection-19            [-1, 3, 68, 91]               0
      BatchNorm2d-20         [-1, 35, 136, 182]              70
             ReLU-21         [-1, 35, 136, 182]               0
     _BNLeakyReLU-22         [-1, 35, 136, 182]               0
           Conv2d-23           [-1, 64, 68, 91]          20,160
      BatchNorm2d-24           [-1, 64, 68, 91]             128
        LeakyReLU-25           [-1, 64, 68, 91]               0
 _ConvBNLeakyReLU-26           [-1, 64, 68, 91]               0
           Conv2d-27           [-1, 64, 68, 91]             576
 _ChannelWiseConv-28           [-1, 64, 68, 91]               0
           Conv2d-29           [-1, 64, 68, 91]             576
 _ChannelWiseConv-30           [-1, 64, 68, 91]               0
      BatchNorm2d-31           [-1, 64, 68, 91]             128
             ReLU-32           [-1, 64, 68, 91]               0
     _BNLeakyReLU-33           [-1, 64, 68, 91]               0
      BatchNorm2d-34           [-1, 64, 68, 91]             128
             ReLU-35           [-1, 64, 68, 91]               0
     _BNLeakyReLU-36           [-1, 64, 68, 91]               0
           Conv2d-37           [-1, 64, 68, 91]           8,192
           Conv2d-38            [-1, 8, 68, 91]             520
             ReLU-39            [-1, 8, 68, 91]               0
           Conv2d-40           [-1, 64, 68, 91]             576
         Hardtanh-41           [-1, 64, 68, 91]               0
           _FGlo1-42           [-1, 64, 68, 91]               0
ContextGuidedBlock-43           [-1, 64, 68, 91]               0
           Conv2d-44           [-1, 32, 68, 91]           2,048
      BatchNorm2d-45           [-1, 32, 68, 91]              64
        LeakyReLU-46           [-1, 32, 68, 91]               0
 _ConvBNLeakyReLU-47           [-1, 32, 68, 91]               0
           Conv2d-48           [-1, 32, 68, 91]             288
 _ChannelWiseConv-49           [-1, 32, 68, 91]               0
           Conv2d-50           [-1, 32, 68, 91]             288
 _ChannelWiseConv-51           [-1, 32, 68, 91]               0
      BatchNorm2d-52           [-1, 32, 68, 91]              64
             ReLU-53           [-1, 32, 68, 91]               0
     _BNLeakyReLU-54           [-1, 32, 68, 91]               0
      BatchNorm2d-55           [-1, 32, 68, 91]              64
             ReLU-56           [-1, 32, 68, 91]               0
     _BNLeakyReLU-57           [-1, 32, 68, 91]               0
           Conv2d-58            [-1, 8, 68, 91]             520
             ReLU-59            [-1, 8, 68, 91]               0
           Conv2d-60           [-1, 64, 68, 91]             576
         Hardtanh-61           [-1, 64, 68, 91]               0
           _FGlo1-62           [-1, 64, 68, 91]               0
ContextGuidedBlock-63           [-1, 64, 68, 91]               0
           Conv2d-64           [-1, 32, 68, 91]           2,048
      BatchNorm2d-65           [-1, 32, 68, 91]              64
        LeakyReLU-66           [-1, 32, 68, 91]               0
 _ConvBNLeakyReLU-67           [-1, 32, 68, 91]               0
           Conv2d-68           [-1, 32, 68, 91]             288
 _ChannelWiseConv-69           [-1, 32, 68, 91]               0
           Conv2d-70           [-1, 32, 68, 91]             288
 _ChannelWiseConv-71           [-1, 32, 68, 91]               0
      BatchNorm2d-72           [-1, 32, 68, 91]              64
             ReLU-73           [-1, 32, 68, 91]               0
     _BNLeakyReLU-74           [-1, 32, 68, 91]               0
      BatchNorm2d-75           [-1, 32, 68, 91]              64
             ReLU-76           [-1, 32, 68, 91]               0
     _BNLeakyReLU-77           [-1, 32, 68, 91]               0
           Conv2d-78            [-1, 8, 68, 91]             520
             ReLU-79            [-1, 8, 68, 91]               0
           Conv2d-80           [-1, 64, 68, 91]             576
         Hardtanh-81           [-1, 64, 68, 91]               0
           _FGlo1-82           [-1, 64, 68, 91]               0
ContextGuidedBlock-83           [-1, 64, 68, 91]               0
           Conv2d-84           [-1, 32, 68, 91]           2,048
      BatchNorm2d-85           [-1, 32, 68, 91]              64
        LeakyReLU-86           [-1, 32, 68, 91]               0
 _ConvBNLeakyReLU-87           [-1, 32, 68, 91]               0
           Conv2d-88           [-1, 32, 68, 91]             288
 _ChannelWiseConv-89           [-1, 32, 68, 91]               0
           Conv2d-90           [-1, 32, 68, 91]             288
 _ChannelWiseConv-91           [-1, 32, 68, 91]               0
      BatchNorm2d-92           [-1, 32, 68, 91]              64
             ReLU-93           [-1, 32, 68, 91]               0
     _BNLeakyReLU-94           [-1, 32, 68, 91]               0
      BatchNorm2d-95           [-1, 32, 68, 91]              64
             ReLU-96           [-1, 32, 68, 91]               0
     _BNLeakyReLU-97           [-1, 32, 68, 91]               0
           Conv2d-98            [-1, 8, 68, 91]             520
             ReLU-99            [-1, 8, 68, 91]               0
          Conv2d-100           [-1, 64, 68, 91]             576
        Hardtanh-101           [-1, 64, 68, 91]               0
          _FGlo1-102           [-1, 64, 68, 91]               0
ContextGuidedBlock-103           [-1, 64, 68, 91]               0
     BatchNorm2d-104          [-1, 131, 68, 91]             262
            ReLU-105          [-1, 131, 68, 91]               0
    _BNLeakyReLU-106          [-1, 131, 68, 91]               0
          Conv2d-107          [-1, 128, 34, 46]         150,912
     BatchNorm2d-108          [-1, 128, 34, 46]             256
       LeakyReLU-109          [-1, 128, 34, 46]               0
_ConvBNLeakyReLU-110          [-1, 128, 34, 46]               0
          Conv2d-111          [-1, 128, 34, 46]           1,152
_ChannelWiseConv-112          [-1, 128, 34, 46]               0
          Conv2d-113          [-1, 128, 34, 46]           1,152
_ChannelWiseConv-114          [-1, 128, 34, 46]               0
     BatchNorm2d-115          [-1, 128, 34, 46]             256
            ReLU-116          [-1, 128, 34, 46]               0
    _BNLeakyReLU-117          [-1, 128, 34, 46]               0
     BatchNorm2d-118          [-1, 128, 34, 46]             256
            ReLU-119          [-1, 128, 34, 46]               0
    _BNLeakyReLU-120          [-1, 128, 34, 46]               0
          Conv2d-121          [-1, 128, 34, 46]          32,768
          Conv2d-122            [-1, 8, 34, 46]           1,032
            ReLU-123            [-1, 8, 34, 46]               0
          Conv2d-124          [-1, 128, 34, 46]           1,152
        Hardtanh-125          [-1, 128, 34, 46]               0
          _FGlo1-126          [-1, 128, 34, 46]               0
ContextGuidedBlock-127          [-1, 128, 34, 46]               0
          Conv2d-128           [-1, 64, 34, 46]           8,192
     BatchNorm2d-129           [-1, 64, 34, 46]             128
       LeakyReLU-130           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-131           [-1, 64, 34, 46]               0
          Conv2d-132           [-1, 64, 34, 46]             576
_ChannelWiseConv-133           [-1, 64, 34, 46]               0
          Conv2d-134           [-1, 64, 34, 46]             576
_ChannelWiseConv-135           [-1, 64, 34, 46]               0
     BatchNorm2d-136           [-1, 64, 34, 46]             128
            ReLU-137           [-1, 64, 34, 46]               0
    _BNLeakyReLU-138           [-1, 64, 34, 46]               0
     BatchNorm2d-139           [-1, 64, 34, 46]             128
            ReLU-140           [-1, 64, 34, 46]               0
    _BNLeakyReLU-141           [-1, 64, 34, 46]               0
          Conv2d-142            [-1, 8, 34, 46]           1,032
            ReLU-143            [-1, 8, 34, 46]               0
          Conv2d-144          [-1, 128, 34, 46]           1,152
        Hardtanh-145          [-1, 128, 34, 46]               0
          _FGlo1-146          [-1, 128, 34, 46]               0
ContextGuidedBlock-147          [-1, 128, 34, 46]               0
          Conv2d-148           [-1, 64, 34, 46]           8,192
     BatchNorm2d-149           [-1, 64, 34, 46]             128
       LeakyReLU-150           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-151           [-1, 64, 34, 46]               0
          Conv2d-152           [-1, 64, 34, 46]             576
_ChannelWiseConv-153           [-1, 64, 34, 46]               0
          Conv2d-154           [-1, 64, 34, 46]             576
_ChannelWiseConv-155           [-1, 64, 34, 46]               0
     BatchNorm2d-156           [-1, 64, 34, 46]             128
            ReLU-157           [-1, 64, 34, 46]               0
    _BNLeakyReLU-158           [-1, 64, 34, 46]               0
     BatchNorm2d-159           [-1, 64, 34, 46]             128
            ReLU-160           [-1, 64, 34, 46]               0
    _BNLeakyReLU-161           [-1, 64, 34, 46]               0
          Conv2d-162            [-1, 8, 34, 46]           1,032
            ReLU-163            [-1, 8, 34, 46]               0
          Conv2d-164          [-1, 128, 34, 46]           1,152
        Hardtanh-165          [-1, 128, 34, 46]               0
          _FGlo1-166          [-1, 128, 34, 46]               0
ContextGuidedBlock-167          [-1, 128, 34, 46]               0
          Conv2d-168           [-1, 64, 34, 46]           8,192
     BatchNorm2d-169           [-1, 64, 34, 46]             128
       LeakyReLU-170           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-171           [-1, 64, 34, 46]               0
          Conv2d-172           [-1, 64, 34, 46]             576
_ChannelWiseConv-173           [-1, 64, 34, 46]               0
          Conv2d-174           [-1, 64, 34, 46]             576
_ChannelWiseConv-175           [-1, 64, 34, 46]               0
     BatchNorm2d-176           [-1, 64, 34, 46]             128
            ReLU-177           [-1, 64, 34, 46]               0
    _BNLeakyReLU-178           [-1, 64, 34, 46]               0
     BatchNorm2d-179           [-1, 64, 34, 46]             128
            ReLU-180           [-1, 64, 34, 46]               0
    _BNLeakyReLU-181           [-1, 64, 34, 46]               0
          Conv2d-182            [-1, 8, 34, 46]           1,032
            ReLU-183            [-1, 8, 34, 46]               0
          Conv2d-184          [-1, 128, 34, 46]           1,152
        Hardtanh-185          [-1, 128, 34, 46]               0
          _FGlo1-186          [-1, 128, 34, 46]               0
ContextGuidedBlock-187          [-1, 128, 34, 46]               0
          Conv2d-188           [-1, 64, 34, 46]           8,192
     BatchNorm2d-189           [-1, 64, 34, 46]             128
       LeakyReLU-190           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-191           [-1, 64, 34, 46]               0
          Conv2d-192           [-1, 64, 34, 46]             576
_ChannelWiseConv-193           [-1, 64, 34, 46]               0
          Conv2d-194           [-1, 64, 34, 46]             576
_ChannelWiseConv-195           [-1, 64, 34, 46]               0
     BatchNorm2d-196           [-1, 64, 34, 46]             128
            ReLU-197           [-1, 64, 34, 46]               0
    _BNLeakyReLU-198           [-1, 64, 34, 46]               0
     BatchNorm2d-199           [-1, 64, 34, 46]             128
            ReLU-200           [-1, 64, 34, 46]               0
    _BNLeakyReLU-201           [-1, 64, 34, 46]               0
          Conv2d-202            [-1, 8, 34, 46]           1,032
            ReLU-203            [-1, 8, 34, 46]               0
          Conv2d-204          [-1, 128, 34, 46]           1,152
        Hardtanh-205          [-1, 128, 34, 46]               0
          _FGlo1-206          [-1, 128, 34, 46]               0
ContextGuidedBlock-207          [-1, 128, 34, 46]               0
          Conv2d-208           [-1, 64, 34, 46]           8,192
     BatchNorm2d-209           [-1, 64, 34, 46]             128
       LeakyReLU-210           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-211           [-1, 64, 34, 46]               0
          Conv2d-212           [-1, 64, 34, 46]             576
_ChannelWiseConv-213           [-1, 64, 34, 46]               0
          Conv2d-214           [-1, 64, 34, 46]             576
_ChannelWiseConv-215           [-1, 64, 34, 46]               0
     BatchNorm2d-216           [-1, 64, 34, 46]             128
            ReLU-217           [-1, 64, 34, 46]               0
    _BNLeakyReLU-218           [-1, 64, 34, 46]               0
     BatchNorm2d-219           [-1, 64, 34, 46]             128
            ReLU-220           [-1, 64, 34, 46]               0
    _BNLeakyReLU-221           [-1, 64, 34, 46]               0
          Conv2d-222            [-1, 8, 34, 46]           1,032
            ReLU-223            [-1, 8, 34, 46]               0
          Conv2d-224          [-1, 128, 34, 46]           1,152
        Hardtanh-225          [-1, 128, 34, 46]               0
          _FGlo1-226          [-1, 128, 34, 46]               0
ContextGuidedBlock-227          [-1, 128, 34, 46]               0
          Conv2d-228           [-1, 64, 34, 46]           8,192
     BatchNorm2d-229           [-1, 64, 34, 46]             128
       LeakyReLU-230           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-231           [-1, 64, 34, 46]               0
          Conv2d-232           [-1, 64, 34, 46]             576
_ChannelWiseConv-233           [-1, 64, 34, 46]               0
          Conv2d-234           [-1, 64, 34, 46]             576
_ChannelWiseConv-235           [-1, 64, 34, 46]               0
     BatchNorm2d-236           [-1, 64, 34, 46]             128
            ReLU-237           [-1, 64, 34, 46]               0
    _BNLeakyReLU-238           [-1, 64, 34, 46]               0
     BatchNorm2d-239           [-1, 64, 34, 46]             128
            ReLU-240           [-1, 64, 34, 46]               0
    _BNLeakyReLU-241           [-1, 64, 34, 46]               0
          Conv2d-242            [-1, 8, 34, 46]           1,032
            ReLU-243            [-1, 8, 34, 46]               0
          Conv2d-244          [-1, 128, 34, 46]           1,152
        Hardtanh-245          [-1, 128, 34, 46]               0
          _FGlo1-246          [-1, 128, 34, 46]               0
ContextGuidedBlock-247          [-1, 128, 34, 46]               0
          Conv2d-248           [-1, 64, 34, 46]           8,192
     BatchNorm2d-249           [-1, 64, 34, 46]             128
       LeakyReLU-250           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-251           [-1, 64, 34, 46]               0
          Conv2d-252           [-1, 64, 34, 46]             576
_ChannelWiseConv-253           [-1, 64, 34, 46]               0
          Conv2d-254           [-1, 64, 34, 46]             576
_ChannelWiseConv-255           [-1, 64, 34, 46]               0
     BatchNorm2d-256           [-1, 64, 34, 46]             128
            ReLU-257           [-1, 64, 34, 46]               0
    _BNLeakyReLU-258           [-1, 64, 34, 46]               0
     BatchNorm2d-259           [-1, 64, 34, 46]             128
            ReLU-260           [-1, 64, 34, 46]               0
    _BNLeakyReLU-261           [-1, 64, 34, 46]               0
          Conv2d-262            [-1, 8, 34, 46]           1,032
            ReLU-263            [-1, 8, 34, 46]               0
          Conv2d-264          [-1, 128, 34, 46]           1,152
        Hardtanh-265          [-1, 128, 34, 46]               0
          _FGlo1-266          [-1, 128, 34, 46]               0
ContextGuidedBlock-267          [-1, 128, 34, 46]               0
          Conv2d-268           [-1, 64, 34, 46]           8,192
     BatchNorm2d-269           [-1, 64, 34, 46]             128
       LeakyReLU-270           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-271           [-1, 64, 34, 46]               0
          Conv2d-272           [-1, 64, 34, 46]             576
_ChannelWiseConv-273           [-1, 64, 34, 46]               0
          Conv2d-274           [-1, 64, 34, 46]             576
_ChannelWiseConv-275           [-1, 64, 34, 46]               0
     BatchNorm2d-276           [-1, 64, 34, 46]             128
            ReLU-277           [-1, 64, 34, 46]               0
    _BNLeakyReLU-278           [-1, 64, 34, 46]               0
     BatchNorm2d-279           [-1, 64, 34, 46]             128
            ReLU-280           [-1, 64, 34, 46]               0
    _BNLeakyReLU-281           [-1, 64, 34, 46]               0
          Conv2d-282            [-1, 8, 34, 46]           1,032
            ReLU-283            [-1, 8, 34, 46]               0
          Conv2d-284          [-1, 128, 34, 46]           1,152
        Hardtanh-285          [-1, 128, 34, 46]               0
          _FGlo1-286          [-1, 128, 34, 46]               0
ContextGuidedBlock-287          [-1, 128, 34, 46]               0
          Conv2d-288           [-1, 64, 34, 46]           8,192
     BatchNorm2d-289           [-1, 64, 34, 46]             128
       LeakyReLU-290           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-291           [-1, 64, 34, 46]               0
          Conv2d-292           [-1, 64, 34, 46]             576
_ChannelWiseConv-293           [-1, 64, 34, 46]               0
          Conv2d-294           [-1, 64, 34, 46]             576
_ChannelWiseConv-295           [-1, 64, 34, 46]               0
     BatchNorm2d-296           [-1, 64, 34, 46]             128
            ReLU-297           [-1, 64, 34, 46]               0
    _BNLeakyReLU-298           [-1, 64, 34, 46]               0
     BatchNorm2d-299           [-1, 64, 34, 46]             128
            ReLU-300           [-1, 64, 34, 46]               0
    _BNLeakyReLU-301           [-1, 64, 34, 46]               0
          Conv2d-302            [-1, 8, 34, 46]           1,032
            ReLU-303            [-1, 8, 34, 46]               0
          Conv2d-304          [-1, 128, 34, 46]           1,152
        Hardtanh-305          [-1, 128, 34, 46]               0
          _FGlo1-306          [-1, 128, 34, 46]               0
ContextGuidedBlock-307          [-1, 128, 34, 46]               0
          Conv2d-308           [-1, 64, 34, 46]           8,192
     BatchNorm2d-309           [-1, 64, 34, 46]             128
       LeakyReLU-310           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-311           [-1, 64, 34, 46]               0
          Conv2d-312           [-1, 64, 34, 46]             576
_ChannelWiseConv-313           [-1, 64, 34, 46]               0
          Conv2d-314           [-1, 64, 34, 46]             576
_ChannelWiseConv-315           [-1, 64, 34, 46]               0
     BatchNorm2d-316           [-1, 64, 34, 46]             128
            ReLU-317           [-1, 64, 34, 46]               0
    _BNLeakyReLU-318           [-1, 64, 34, 46]               0
     BatchNorm2d-319           [-1, 64, 34, 46]             128
            ReLU-320           [-1, 64, 34, 46]               0
    _BNLeakyReLU-321           [-1, 64, 34, 46]               0
          Conv2d-322            [-1, 8, 34, 46]           1,032
            ReLU-323            [-1, 8, 34, 46]               0
          Conv2d-324          [-1, 128, 34, 46]           1,152
        Hardtanh-325          [-1, 128, 34, 46]               0
          _FGlo1-326          [-1, 128, 34, 46]               0
ContextGuidedBlock-327          [-1, 128, 34, 46]               0
          Conv2d-328           [-1, 64, 34, 46]           8,192
     BatchNorm2d-329           [-1, 64, 34, 46]             128
       LeakyReLU-330           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-331           [-1, 64, 34, 46]               0
          Conv2d-332           [-1, 64, 34, 46]             576
_ChannelWiseConv-333           [-1, 64, 34, 46]               0
          Conv2d-334           [-1, 64, 34, 46]             576
_ChannelWiseConv-335           [-1, 64, 34, 46]               0
     BatchNorm2d-336           [-1, 64, 34, 46]             128
            ReLU-337           [-1, 64, 34, 46]               0
    _BNLeakyReLU-338           [-1, 64, 34, 46]               0
     BatchNorm2d-339           [-1, 64, 34, 46]             128
            ReLU-340           [-1, 64, 34, 46]               0
    _BNLeakyReLU-341           [-1, 64, 34, 46]               0
          Conv2d-342            [-1, 8, 34, 46]           1,032
            ReLU-343            [-1, 8, 34, 46]               0
          Conv2d-344          [-1, 128, 34, 46]           1,152
        Hardtanh-345          [-1, 128, 34, 46]               0
          _FGlo1-346          [-1, 128, 34, 46]               0
ContextGuidedBlock-347          [-1, 128, 34, 46]               0
          Conv2d-348           [-1, 64, 34, 46]           8,192
     BatchNorm2d-349           [-1, 64, 34, 46]             128
       LeakyReLU-350           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-351           [-1, 64, 34, 46]               0
          Conv2d-352           [-1, 64, 34, 46]             576
_ChannelWiseConv-353           [-1, 64, 34, 46]               0
          Conv2d-354           [-1, 64, 34, 46]             576
_ChannelWiseConv-355           [-1, 64, 34, 46]               0
     BatchNorm2d-356           [-1, 64, 34, 46]             128
            ReLU-357           [-1, 64, 34, 46]               0
    _BNLeakyReLU-358           [-1, 64, 34, 46]               0
     BatchNorm2d-359           [-1, 64, 34, 46]             128
            ReLU-360           [-1, 64, 34, 46]               0
    _BNLeakyReLU-361           [-1, 64, 34, 46]               0
          Conv2d-362            [-1, 8, 34, 46]           1,032
            ReLU-363            [-1, 8, 34, 46]               0
          Conv2d-364          [-1, 128, 34, 46]           1,152
        Hardtanh-365          [-1, 128, 34, 46]               0
          _FGlo1-366          [-1, 128, 34, 46]               0
ContextGuidedBlock-367          [-1, 128, 34, 46]               0
          Conv2d-368           [-1, 64, 34, 46]           8,192
     BatchNorm2d-369           [-1, 64, 34, 46]             128
       LeakyReLU-370           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-371           [-1, 64, 34, 46]               0
          Conv2d-372           [-1, 64, 34, 46]             576
_ChannelWiseConv-373           [-1, 64, 34, 46]               0
          Conv2d-374           [-1, 64, 34, 46]             576
_ChannelWiseConv-375           [-1, 64, 34, 46]               0
     BatchNorm2d-376           [-1, 64, 34, 46]             128
            ReLU-377           [-1, 64, 34, 46]               0
    _BNLeakyReLU-378           [-1, 64, 34, 46]               0
     BatchNorm2d-379           [-1, 64, 34, 46]             128
            ReLU-380           [-1, 64, 34, 46]               0
    _BNLeakyReLU-381           [-1, 64, 34, 46]               0
          Conv2d-382            [-1, 8, 34, 46]           1,032
            ReLU-383            [-1, 8, 34, 46]               0
          Conv2d-384          [-1, 128, 34, 46]           1,152
        Hardtanh-385          [-1, 128, 34, 46]               0
          _FGlo1-386          [-1, 128, 34, 46]               0
ContextGuidedBlock-387          [-1, 128, 34, 46]               0
          Conv2d-388           [-1, 64, 34, 46]           8,192
     BatchNorm2d-389           [-1, 64, 34, 46]             128
       LeakyReLU-390           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-391           [-1, 64, 34, 46]               0
          Conv2d-392           [-1, 64, 34, 46]             576
_ChannelWiseConv-393           [-1, 64, 34, 46]               0
          Conv2d-394           [-1, 64, 34, 46]             576
_ChannelWiseConv-395           [-1, 64, 34, 46]               0
     BatchNorm2d-396           [-1, 64, 34, 46]             128
            ReLU-397           [-1, 64, 34, 46]               0
    _BNLeakyReLU-398           [-1, 64, 34, 46]               0
     BatchNorm2d-399           [-1, 64, 34, 46]             128
            ReLU-400           [-1, 64, 34, 46]               0
    _BNLeakyReLU-401           [-1, 64, 34, 46]               0
          Conv2d-402            [-1, 8, 34, 46]           1,032
            ReLU-403            [-1, 8, 34, 46]               0
          Conv2d-404          [-1, 128, 34, 46]           1,152
        Hardtanh-405          [-1, 128, 34, 46]               0
          _FGlo1-406          [-1, 128, 34, 46]               0
ContextGuidedBlock-407          [-1, 128, 34, 46]               0
          Conv2d-408           [-1, 64, 34, 46]           8,192
     BatchNorm2d-409           [-1, 64, 34, 46]             128
       LeakyReLU-410           [-1, 64, 34, 46]               0
_ConvBNLeakyReLU-411           [-1, 64, 34, 46]               0
          Conv2d-412           [-1, 64, 34, 46]             576
_ChannelWiseConv-413           [-1, 64, 34, 46]               0
          Conv2d-414           [-1, 64, 34, 46]             576
_ChannelWiseConv-415           [-1, 64, 34, 46]               0
     BatchNorm2d-416           [-1, 64, 34, 46]             128
            ReLU-417           [-1, 64, 34, 46]               0
    _BNLeakyReLU-418           [-1, 64, 34, 46]               0
     BatchNorm2d-419           [-1, 64, 34, 46]             128
            ReLU-420           [-1, 64, 34, 46]               0
    _BNLeakyReLU-421           [-1, 64, 34, 46]               0
          Conv2d-422            [-1, 8, 34, 46]           1,032
            ReLU-423            [-1, 8, 34, 46]               0
          Conv2d-424          [-1, 128, 34, 46]           1,152
        Hardtanh-425          [-1, 128, 34, 46]               0
          _FGlo1-426          [-1, 128, 34, 46]               0
ContextGuidedBlock-427          [-1, 128, 34, 46]               0
       Dropout2d-428          [-1, 256, 34, 46]               0
          Conv2d-429            [-1, 1, 34, 46]             257
================================================================
Total params: 430,413
Trainable params: 430,413
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 18.13
Forward/backward pass size (MB): 571.50
Params size (MB): 1.64
Estimated Total Size (MB): 591.27
----------------------------------------------------------------
